LES(SparlatAlmarasDDES)/system/fieldVariables
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      volFlux;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
    //----------------------------------
    //Y-Plus   
    //----------------------------------
   
    yPlusFluid
    {
        type            yPlus;
        libs            ("fieldFunctionObjects");
        writeControl    writeTime;
        writeFields     true;
    }

    //----------------------------------
    //Volume flux    
    //----------------------------------
   
    
    volfluxIn
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             false;
        regionType      patch;
        name            inlet;
        fields          (phi);
        operation       sum;
    }
    volfluxOut
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             false;
        regionType      patch;
        name            outlet;
        fields          (phi);
        operation       sum;
    } 

// ************************************************************************* //
