LES(SparlatAlmarasDDES)/system/residuals
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    For specified fields, writes out the initial residuals for the first
    solution of each time step; for non-scalar fields (e.g. vectors), writes
    the largest of the residuals for each component (e.g. x, y, z).

\*---------------------------------------------------------------------------*/

solverInfo
{
  type          solverInfo;

  libs          (utilityFunctionObjects);
  
  writeControl  timeStep;

  fields        (U p); 

  writeResidualsFields   no;

}


// ************************************************************************* //

